backend/app/payments/tests/__snapshots__/test_check_previous_customer_multiple_customer.yaml

interactions:
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Bearer sk_test_jvZ3yrlb77roQiXw6HnSNvXH00VXDVY0G4
      Connection:
      - keep-alive
      User-Agent:
      - Stripe/v1 PythonBindings/2.40.0
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.40.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.7.4", "platform": "Linux-4.19.76-linuxkit-x86_64-with",
        "uname": "Linux db5531980fa4 4.19.76-linuxkit #1 SMP Thu Oct 17 19:31:58 UTC
        2019 x86_64 "}'
    method: GET
    uri: https://api.stripe.com/v1/customers?email=cat1%40cat.com
  response:
    body:
      string: "{\n  \"object\": \"list\",\n  \"data\": [\n    {\n      \"id\": \"\
        cus_H1OgtZ5D2gRb32\",\n      \"object\": \"customer\",\n      \"account_balance\"\
        : 0,\n      \"address\": null,\n      \"balance\": 0,\n      \"created\":\
        \ 1585806421,\n      \"currency\": null,\n      \"default_source\": null,\n\
        \      \"delinquent\": false,\n      \"description\": \"test cat2\",\n   \
        \   \"discount\": null,\n      \"email\": \"cat1@cat.com\",\n      \"invoice_prefix\"\
        : \"DEEB6AC0\",\n      \"invoice_settings\": {\n        \"custom_fields\"\
        : null,\n        \"default_payment_method\": null,\n        \"footer\": null\n\
        \      },\n      \"livemode\": false,\n      \"metadata\": {\n      },\n \
        \     \"name\": \"cat2\",\n      \"next_invoice_sequence\": 1,\n      \"phone\"\
        : null,\n      \"preferred_locales\": [\n\n      ],\n      \"shipping\": {\n\
        \        \"address\": {\n          \"city\": \"\",\n          \"country\"\
        : \"\",\n          \"line1\": \"\",\n          \"line2\": \"\",\n        \
        \  \"postal_code\": \"\",\n          \"state\": \"\"\n        },\n       \
        \ \"name\": \"cat2\",\n        \"phone\": \"\"\n      },\n      \"sources\"\
        : {\n        \"object\": \"list\",\n        \"data\": [\n\n        ],\n  \
        \      \"has_more\": false,\n        \"total_count\": 0,\n        \"url\"\
        : \"/v1/customers/cus_H1OgtZ5D2gRb32/sources\"\n      },\n      \"subscriptions\"\
        : {\n        \"object\": \"list\",\n        \"data\": [\n\n        ],\n  \
        \      \"has_more\": false,\n        \"total_count\": 0,\n        \"url\"\
        : \"/v1/customers/cus_H1OgtZ5D2gRb32/subscriptions\"\n      },\n      \"tax_exempt\"\
        : \"none\",\n      \"tax_ids\": {\n        \"object\": \"list\",\n       \
        \ \"data\": [\n\n        ],\n        \"has_more\": false,\n        \"total_count\"\
        : 0,\n        \"url\": \"/v1/customers/cus_H1OgtZ5D2gRb32/tax_ids\"\n    \
        \  },\n      \"tax_info\": null,\n      \"tax_info_verification\": null\n\
        \    },\n    {\n      \"id\": \"cus_H1NHcDTMTp7atC\",\n      \"object\": \"\
        customer\",\n      \"account_balance\": 0,\n      \"address\": null,\n   \
        \   \"balance\": 0,\n      \"created\": 1585801164,\n      \"currency\": \"\
        usd\",\n      \"default_source\": null,\n      \"delinquent\": false,\n  \
        \    \"description\": null,\n      \"discount\": null,\n      \"email\": \"\
        cat1@cat.com\",\n      \"invoice_prefix\": \"08E06654\",\n      \"invoice_settings\"\
        : {\n        \"custom_fields\": null,\n        \"default_payment_method\"\
        : null,\n        \"footer\": null\n      },\n      \"livemode\": false,\n\
        \      \"metadata\": {\n      },\n      \"name\": null,\n      \"next_invoice_sequence\"\
        : 3,\n      \"phone\": null,\n      \"preferred_locales\": [\n\n      ],\n\
        \      \"shipping\": null,\n      \"sources\": {\n        \"object\": \"list\"\
        ,\n        \"data\": [\n\n        ],\n        \"has_more\": false,\n     \
        \   \"total_count\": 0,\n        \"url\": \"/v1/customers/cus_H1NHcDTMTp7atC/sources\"\
        \n      },\n      \"subscriptions\": {\n        \"object\": \"list\",\n  \
        \      \"data\": [\n\n        ],\n        \"has_more\": false,\n        \"\
        total_count\": 0,\n        \"url\": \"/v1/customers/cus_H1NHcDTMTp7atC/subscriptions\"\
        \n      },\n      \"tax_exempt\": \"none\",\n      \"tax_ids\": {\n      \
        \  \"object\": \"list\",\n        \"data\": [\n\n        ],\n        \"has_more\"\
        : false,\n        \"total_count\": 0,\n        \"url\": \"/v1/customers/cus_H1NHcDTMTp7atC/tax_ids\"\
        \n      },\n      \"tax_info\": null,\n      \"tax_info_verification\": null\n\
        \    }\n  ],\n  \"has_more\": false,\n  \"url\": \"/v1/customers\"\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '3085'
      Content-Type:
      - application/json
      Date:
      - Thu, 02 Apr 2020 05:52:58 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      request-id:
      - req_htpdQn8fhsjToQ
      stripe-version:
      - '2019-09-09'
    status:
      code: 200
      message: OK
version: 1
