backend/app/payments/tests/__snapshots__/test_stripe_db_user_paid.yaml

interactions:
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Bearer sk_test_jvZ3yrlb77roQiXw6HnSNvXH00VXDVY0G4
      Connection:
      - keep-alive
      User-Agent:
      - Stripe/v1 PythonBindings/2.40.0
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_c35rrD3uQOsezH", "request_duration_ms":
        12}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.40.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.7.4", "platform": "Linux-4.19.76-linuxkit-x86_64-with",
        "uname": "Linux db5531980fa4 4.19.76-linuxkit #1 SMP Thu Oct 17 19:31:58 UTC
        2019 x86_64 "}'
    method: GET
    uri: https://api.stripe.com/v1/customers?email=rahul%40getpulp.io
  response:
    body:
      string: "{\n  \"object\": \"list\",\n  \"data\": [\n    {\n      \"id\": \"\
        cus_H1HoIrfnLjPRnW\",\n      \"object\": \"customer\",\n      \"account_balance\"\
        : 0,\n      \"address\": null,\n      \"balance\": 0,\n      \"created\":\
        \ 1585780841,\n      \"currency\": \"usd\",\n      \"default_source\": null,\n\
        \      \"delinquent\": false,\n      \"description\": null,\n      \"discount\"\
        : null,\n      \"email\": \"rahul@getpulp.io\",\n      \"invoice_prefix\"\
        : \"C0408B50\",\n      \"invoice_settings\": {\n        \"custom_fields\"\
        : null,\n        \"default_payment_method\": null,\n        \"footer\": null\n\
        \      },\n      \"livemode\": false,\n      \"metadata\": {\n      },\n \
        \     \"name\": null,\n      \"next_invoice_sequence\": 3,\n      \"phone\"\
        : null,\n      \"preferred_locales\": [\n\n      ],\n      \"shipping\": null,\n\
        \      \"sources\": {\n        \"object\": \"list\",\n        \"data\": [\n\
        \n        ],\n        \"has_more\": false,\n        \"total_count\": 0,\n\
        \        \"url\": \"/v1/customers/cus_H1HoIrfnLjPRnW/sources\"\n      },\n\
        \      \"subscriptions\": {\n        \"object\": \"list\",\n        \"data\"\
        : [\n          {\n            \"id\": \"sub_H1NCvGBXbVvLp7\",\n          \
        \  \"object\": \"subscription\",\n            \"application_fee_percent\"\
        : null,\n            \"billing\": \"charge_automatically\",\n            \"\
        billing_cycle_anchor\": 1585800914,\n            \"billing_thresholds\": null,\n\
        \            \"cancel_at\": null,\n            \"cancel_at_period_end\": false,\n\
        \            \"canceled_at\": null,\n            \"collection_method\": \"\
        charge_automatically\",\n            \"created\": 1585800914,\n          \
        \  \"current_period_end\": 1588392914,\n            \"current_period_start\"\
        : 1585800914,\n            \"customer\": \"cus_H1HoIrfnLjPRnW\",\n       \
        \     \"days_until_due\": null,\n            \"default_payment_method\": \"\
        pm_1GTKSUHTMy2ngeDKS4oGfKG5\",\n            \"default_source\": null,\n  \
        \          \"default_tax_rates\": [\n\n            ],\n            \"discount\"\
        : null,\n            \"ended_at\": null,\n            \"invoice_customer_balance_settings\"\
        : {\n              \"consume_applied_balance_on_void\": true\n           \
        \ },\n            \"items\": {\n              \"object\": \"list\",\n    \
        \          \"data\": [\n                {\n                  \"id\": \"si_H1NCmeRkFpanCS\"\
        ,\n                  \"object\": \"subscription_item\",\n                \
        \  \"billing_thresholds\": null,\n                  \"created\": 1585800915,\n\
        \                  \"metadata\": {\n                  },\n               \
        \   \"plan\": {\n                    \"id\": \"plan_H1Ci4XHaGDHOLy\",\n  \
        \                  \"object\": \"plan\",\n                    \"active\":\
        \ true,\n                    \"aggregate_usage\": null,\n                \
        \    \"amount\": 799,\n                    \"amount_decimal\": \"799\",\n\
        \                    \"billing_scheme\": \"per_unit\",\n                 \
        \   \"created\": 1585761906,\n                    \"currency\": \"usd\",\n\
        \                    \"interval\": \"month\",\n                    \"interval_count\"\
        : 1,\n                    \"livemode\": false,\n                    \"metadata\"\
        : {\n                    },\n                    \"nickname\": \"1x/month\"\
        ,\n                    \"product\": \"prod_H1CZ5dILCmMJER\",\n           \
        \         \"tiers\": null,\n                    \"tiers_mode\": null,\n  \
        \                  \"transform_usage\": null,\n                    \"trial_period_days\"\
        : null,\n                    \"usage_type\": \"licensed\"\n              \
        \    },\n                  \"quantity\": 1,\n                  \"subscription\"\
        : \"sub_H1NCvGBXbVvLp7\",\n                  \"tax_rates\": [\n\n        \
        \          ]\n                }\n              ],\n              \"has_more\"\
        : false,\n              \"total_count\": 1,\n              \"url\": \"/v1/subscription_items?subscription=sub_H1NCvGBXbVvLp7\"\
        \n            },\n            \"latest_invoice\": \"in_1GTKSUHTMy2ngeDKUV4Y4IjT\"\
        ,\n            \"livemode\": false,\n            \"metadata\": {\n       \
        \     },\n            \"next_pending_invoice_item_invoice\": null,\n     \
        \       \"pause_collection\": null,\n            \"pending_invoice_item_interval\"\
        : null,\n            \"pending_setup_intent\": null,\n            \"pending_update\"\
        : null,\n            \"plan\": {\n              \"id\": \"plan_H1Ci4XHaGDHOLy\"\
        ,\n              \"object\": \"plan\",\n              \"active\": true,\n\
        \              \"aggregate_usage\": null,\n              \"amount\": 799,\n\
        \              \"amount_decimal\": \"799\",\n              \"billing_scheme\"\
        : \"per_unit\",\n              \"created\": 1585761906,\n              \"\
        currency\": \"usd\",\n              \"interval\": \"month\",\n           \
        \   \"interval_count\": 1,\n              \"livemode\": false,\n         \
        \     \"metadata\": {\n              },\n              \"nickname\": \"1x/month\"\
        ,\n              \"product\": \"prod_H1CZ5dILCmMJER\",\n              \"tiers\"\
        : null,\n              \"tiers_mode\": null,\n              \"transform_usage\"\
        : null,\n              \"trial_period_days\": null,\n              \"usage_type\"\
        : \"licensed\"\n            },\n            \"quantity\": 1,\n           \
        \ \"schedule\": null,\n            \"start\": 1585800914,\n            \"\
        start_date\": 1585800914,\n            \"status\": \"active\",\n         \
        \   \"tax_percent\": null,\n            \"trial_end\": null,\n           \
        \ \"trial_start\": null\n          }\n        ],\n        \"has_more\": false,\n\
        \        \"total_count\": 1,\n        \"url\": \"/v1/customers/cus_H1HoIrfnLjPRnW/subscriptions\"\
        \n      },\n      \"tax_exempt\": \"none\",\n      \"tax_ids\": {\n      \
        \  \"object\": \"list\",\n        \"data\": [\n\n        ],\n        \"has_more\"\
        : false,\n        \"total_count\": 0,\n        \"url\": \"/v1/customers/cus_H1HoIrfnLjPRnW/tax_ids\"\
        \n      },\n      \"tax_info\": null,\n      \"tax_info_verification\": null\n\
        \    }\n  ],\n  \"has_more\": false,\n  \"url\": \"/v1/customers\"\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '5439'
      Content-Type:
      - application/json
      Date:
      - Thu, 02 Apr 2020 06:41:31 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      request-id:
      - req_fUlm3XiuAfuizg
      stripe-version:
      - '2019-09-09'
    status:
      code: 200
      message: OK
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Bearer sk_test_jvZ3yrlb77roQiXw6HnSNvXH00VXDVY0G4
      Connection:
      - keep-alive
      User-Agent:
      - Stripe/v1 PythonBindings/2.40.0
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_fUlm3XiuAfuizg", "request_duration_ms":
        477}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.40.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.7.4", "platform": "Linux-4.19.76-linuxkit-x86_64-with",
        "uname": "Linux db5531980fa4 4.19.76-linuxkit #1 SMP Thu Oct 17 19:31:58 UTC
        2019 x86_64 "}'
    method: GET
    uri: https://api.stripe.com/v1/subscriptions/sub_H1NCvGBXbVvLp7
  response:
    body:
      string: "{\n  \"id\": \"sub_H1NCvGBXbVvLp7\",\n  \"object\": \"subscription\"\
        ,\n  \"application_fee_percent\": null,\n  \"billing\": \"charge_automatically\"\
        ,\n  \"billing_cycle_anchor\": 1585800914,\n  \"billing_thresholds\": null,\n\
        \  \"cancel_at\": null,\n  \"cancel_at_period_end\": false,\n  \"canceled_at\"\
        : null,\n  \"collection_method\": \"charge_automatically\",\n  \"created\"\
        : 1585800914,\n  \"current_period_end\": 1588392914,\n  \"current_period_start\"\
        : 1585800914,\n  \"customer\": \"cus_H1HoIrfnLjPRnW\",\n  \"days_until_due\"\
        : null,\n  \"default_payment_method\": \"pm_1GTKSUHTMy2ngeDKS4oGfKG5\",\n\
        \  \"default_source\": null,\n  \"default_tax_rates\": [\n\n  ],\n  \"discount\"\
        : null,\n  \"ended_at\": null,\n  \"invoice_customer_balance_settings\": {\n\
        \    \"consume_applied_balance_on_void\": true\n  },\n  \"items\": {\n   \
        \ \"object\": \"list\",\n    \"data\": [\n      {\n        \"id\": \"si_H1NCmeRkFpanCS\"\
        ,\n        \"object\": \"subscription_item\",\n        \"billing_thresholds\"\
        : null,\n        \"created\": 1585800915,\n        \"metadata\": {\n     \
        \   },\n        \"plan\": {\n          \"id\": \"plan_H1Ci4XHaGDHOLy\",\n\
        \          \"object\": \"plan\",\n          \"active\": true,\n          \"\
        aggregate_usage\": null,\n          \"amount\": 799,\n          \"amount_decimal\"\
        : \"799\",\n          \"billing_scheme\": \"per_unit\",\n          \"created\"\
        : 1585761906,\n          \"currency\": \"usd\",\n          \"interval\": \"\
        month\",\n          \"interval_count\": 1,\n          \"livemode\": false,\n\
        \          \"metadata\": {\n          },\n          \"nickname\": \"1x/month\"\
        ,\n          \"product\": \"prod_H1CZ5dILCmMJER\",\n          \"tiers\": null,\n\
        \          \"tiers_mode\": null,\n          \"transform_usage\": null,\n \
        \         \"trial_period_days\": null,\n          \"usage_type\": \"licensed\"\
        \n        },\n        \"quantity\": 1,\n        \"subscription\": \"sub_H1NCvGBXbVvLp7\"\
        ,\n        \"tax_rates\": [\n\n        ]\n      }\n    ],\n    \"has_more\"\
        : false,\n    \"total_count\": 1,\n    \"url\": \"/v1/subscription_items?subscription=sub_H1NCvGBXbVvLp7\"\
        \n  },\n  \"latest_invoice\": \"in_1GTKSUHTMy2ngeDKUV4Y4IjT\",\n  \"livemode\"\
        : false,\n  \"metadata\": {\n  },\n  \"next_pending_invoice_item_invoice\"\
        : null,\n  \"pause_collection\": null,\n  \"pending_invoice_item_interval\"\
        : null,\n  \"pending_setup_intent\": null,\n  \"pending_update\": null,\n\
        \  \"plan\": {\n    \"id\": \"plan_H1Ci4XHaGDHOLy\",\n    \"object\": \"plan\"\
        ,\n    \"active\": true,\n    \"aggregate_usage\": null,\n    \"amount\":\
        \ 799,\n    \"amount_decimal\": \"799\",\n    \"billing_scheme\": \"per_unit\"\
        ,\n    \"created\": 1585761906,\n    \"currency\": \"usd\",\n    \"interval\"\
        : \"month\",\n    \"interval_count\": 1,\n    \"livemode\": false,\n    \"\
        metadata\": {\n    },\n    \"nickname\": \"1x/month\",\n    \"product\": \"\
        prod_H1CZ5dILCmMJER\",\n    \"tiers\": null,\n    \"tiers_mode\": null,\n\
        \    \"transform_usage\": null,\n    \"trial_period_days\": null,\n    \"\
        usage_type\": \"licensed\"\n  },\n  \"quantity\": 1,\n  \"schedule\": null,\n\
        \  \"start\": 1585800914,\n  \"start_date\": 1585800914,\n  \"status\": \"\
        active\",\n  \"tax_percent\": null,\n  \"trial_end\": null,\n  \"trial_start\"\
        : null\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '2877'
      Content-Type:
      - application/json
      Date:
      - Thu, 02 Apr 2020 06:41:32 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      request-id:
      - req_aM3TmzQs4lvjok
      stripe-version:
      - '2019-09-09'
    status:
      code: 200
      message: OK
version: 1
